In [4]:
import pandas as pd
x = pd.Series([7,3,5,8]) # 색인(인덱스) 없으면 순서대로
x

0    7
1    3
2    5
3    8
dtype: int64

In [6]:
import pandas as pd
x = pd.Series([7,3,5,8], index = ['서울','대구','부산','광주'])
x

서울    7
대구    3
부산    5
광주    8
dtype: int64

In [8]:
import pandas as pd
x = pd.Series([7,3,5,8], index = ['서울','대구','부산','광주'])
x['서울']

7

In [11]:
import pandas as pd
x = pd.Series([7,3,5,8], index = ['서울','대구','부산','광주'])
x[['서울', '대구']]    # [[]] 두개

서울    7
대구    3
dtype: int64

In [16]:
import pandas as pd
x = pd.Series([7,3,5,8], index = ['서울','대구','부산','광주'])
x.index

Index(['서울', '대구', '부산', '광주'], dtype='object')

In [18]:
import pandas as pd
x = pd.Series([7,3,5,8], index = ['서울','대구','부산','광주'])
x.values

array([7, 3, 5, 8])

In [20]:
import pandas as pd
x = pd.Series([7,3,5,8], index = ['서울','대구','부산','광주'])
print(sorted(x.index))    # 오름차순 정렬
print(sorted(x.values))

['광주', '대구', '부산', '서울']
[3, 5, 7, 8]

In [22]:
import pandas as pd
x = pd.Series([7,3,5,8], index = ['서울','대구','부산','광주'])
x.reindex(sorted(x.index))
x

서울    7
대구    3
부산    5
광주    8
dtype: int64

In [24]:
# 시리즈의 합
x = pd.Series([3,8,5,9], index = ['서울','대구','부산','광주'])
y = pd.Series([2,4,5,1], index = ['대구','부산','서울','대전'])
x+y  # 공통된 인덱스만 더할수 있음. 아니면 NaN

광주     NaN
대구    10.0
대전     NaN
부산     9.0
서울     8.0
dtype: float64

In [27]:
# 시리즈의 합
x = pd.Series([3,8,5,9], index = ['서울','대구','부산','광주'])
y = pd.Series([2,4,5,1,3], index = ['대구','부산','서울','대전','전주'])
x+y  # 공통된 인덱스만 더할수 있음. 아니면 NaN

광주     NaN
대구    10.0
대전     NaN
부산     9.0
서울     8.0
전주     NaN
dtype: float64

In [29]:
medal = [1,3,2,4,2,3]
x = pd.Series(medal)
print(pd.unique(x))

[1 3 2 4]

In [31]:
medal = ['민준','현우','서연','동현','서연','현우']
x = pd.Series(medal)
print(pd.unique(x))

['민준' '현우' '서연' '동현']

In [94]:
# 딕셔너리를 시리즈로 변환
age = {'민준':23, '현우':43, '서연':12, '동현':45}
x = pd.Series(age)
x

민준    23
현우    43
서연    12
동현    45
dtype: int64

In [85]:
names = ['민준','서연','현우','민서','동현','수빈']
pdata = pd.Series(names)
a = pdata[3:6]
print(a.values)  # 값만 출력
print(a)         # 인덱스도 같이 출력

['민서' '동현' '수빈']
3    민서
4    동현
5    수빈
dtype: object

In [38]:
b = a[1:2]
print(b)

4    동현
dtype: object

In [40]:
print(a[5])  # 3,4,5 외의 인덱스 a[2], a[1]는 valueError

수빈

In [2]:
# 데이터프레임
import pandas as pd
data = {'age' : [23, 43, 12, 45],
        'name' : ['민준', '현우', '서연', '동현'],
        'height' : [175.3, 180.3, 165.8, 172.7]}
x = pd.DataFrame(data, columns = ['name','age','height'])
x

  name  age  height
0   민준   23   175.3
1   현우   43   180.3
2   서연   12   165.8
3   동현   45   172.7

In [46]:
x.name

0    민준
1    현우
2    서연
3    동현
Name: name, dtype: object

In [48]:
x.age

0    23
1    43
2    12
3    45
Name: age, dtype: int64

In [50]:
x.height

0    175.3
1    180.3
2    165.8
3    172.7
Name: height, dtype: float64

In [52]:
x.name[0]

'민준'

In [54]:
ary = [[1,2],[3,4],[5,6]]
data = pd.DataFrame(ary, columns=['First','Second'])
data

   First  Second
0      1       2
1      3       4
2      5       6

In [57]:
data.iloc[1]     # 1번 행의 값들 출력

First     3
Second    4
Name: 1, dtype: int64

In [60]:
data.iloc[:,-1]   # 모든 행의 마지막 데이터만을 출력

0    2
1    4
2    6
Name: Second, dtype: int64

In [63]:
# head() : 첫 행부터 입력한 수까지 출력 <-> tail
ary = [[1, 2], [3, 4], [5, 6], [7, 8], [9, 10]]
data = pd.DataFrame(ary, columns=['First','Second'])
data.head(3)

   First  Second
0      1       2
1      3       4
2      5       6

In [65]:
ary = [[1, 2], [3, 4], [5, 6], [7, 8], [9, 10]]
data = pd.DataFrame(ary, columns=['First','Second'])
data.tail(3)

   First  Second
2      5       6
3      7       8
4      9      10

In [67]:
ary = [[1, 2], [3, 4], [5, 6], [7, 8], [9, 10]]
data = pd.DataFrame(ary, columns=['First','Second'])

bools = [False, True, True, False, True]    
data.Second[bools]       # True 값의 Second만 출력

1     4
2     6
4    10
Name: Second, dtype: int64

In [69]:
ary = [[1, 2], [3, 4], [5, 6], [7, 8], [9, 10]]
data = pd.DataFrame(ary, columns=['First','Second'])
print(data.mean())     # axis = 0 생략

First     5.0
Second    6.0
dtype: float64

In [72]:
data = {'age' : [23, 43, 12, 45],
        'name' : ['민준', '현우', '서연', '동현'],
        'height' : [175.3, 180.3, 165.8, 172.7]}
x = pd.DataFrame(data, columns = ['name','age','height'])
index = [True, False, True, False]
print(x[index])

  name  age  height
0   민준   23   175.3
2   서연   12   165.8

In [76]:
import pandas as pd
import numpy as np
ary = [[1, 2], [3, 4], [5, 6], [7, 8], [9, 10]]
data = pd.DataFrame(ary, columns=['수온','상온'])
data

   수온  상온
0   1   2
1   3   4
2   5   6
3   7   8
4   9  10

In [78]:
# .astype() : 형변환
data['수온'] = data['수온'].astype('float')
data

    수온  상온
0  1.0   2
1  3.0   4
2  5.0   6
3  7.0   8
4  9.0  10

In [82]:
import pandas as pd
food = pd.read_csv('food.csv', encoding='cp949')
food.head()

    구분     국가         시작일         종료일   성격   비고
0  단독형  말레이시아  2021-06-29  2021-06-29  B2B  온라인
1  단독형     태국  2021-07-29  2021-07-30  B2B  온라인
2  단독형    프랑스  2021-09-09  2021-09-10  B2B  온라인
3  단독형     호주  2021-07-14  2021-07-15  B2B  온라인
4  연계형    베트남  2021-11-04  2021-11-05  B2B  온라인